# Description Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSpace..::..Description Property
EnergyAnalysisSpace Class See Also
---
The description.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string Description { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Description As String
	Get
```

Visual C++
---
```text
public:
property String^ Description {
	String^ get ();
}
```

# See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace